package Day06;
//list set map
//똑같은 데이터 타입이 모여있는걸 '무리' collection이라고 표현한다.




//ex) 0~9번의 중복값이 포함된 {1,2,2,3,3,4,4,5,6,6}
//list : 가장 배열과 비슷하다. 입력한 순서대로 들어가게 된다. 중복값 입력이 가능하다.
//0~9번의 중복값이 포함된 {1,2,2,3,3,4,4,5,6,6}
//set: 내가 입력한 순서대로 들어가지 않을수도 있다. 중복값 허용이 되지 않는다.
//0~9번의 중복값이 포함되지 않은 {1,2,3,4,5,6}
//map: 맵은 위의 친구들과 틀리게 우리가 index번호로 관리하는게 아니라 key -value 구조로써 
//우리가 키값을 주면 그거와 일치하는 value값을 준다. 중복된 키는 허용되지 않는다.
//{"1학년",38}, {"2학년", 40}, {"3학년",27}



//map -> {"1학년", 학생[]} 예시
// 간단다게 구현하기 - 키[], 밸류[]-> 둘다 스트링







public class Ex02{

}